-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 25, 2022 at 12:54 PM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 8.1.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mobile_companies`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `UserID` int(11) NOT NULL,
  `Name` varchar(255) NOT NULL,
  `Email` varchar(255) NOT NULL,
  `Username` varchar(255) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `GroupID` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`UserID`, `Name`, `Email`, `Username`, `Password`, `GroupID`) VALUES
(5, 'Ahmed Adel', 'Ahmed@mail.com', 'Ahmed97', '40bd001563085fc35165329ea1ff5c5ecbdbbeef', 1),
(6, 'Mohamed Turky', 'Turky123@email.com', 'Turky123', '7c4a8d09ca3762af61e59520943dc26494f8941b', 1);

-- --------------------------------------------------------

--
-- Table structure for table `evaluation`
--

CREATE TABLE `evaluation` (
  `mobile name` varchar(255) NOT NULL,
  `processor` varchar(255) NOT NULL,
  `camera` varchar(255) NOT NULL,
  `screen` varchar(255) NOT NULL,
  `storage` varchar(255) NOT NULL,
  `battery` varchar(255) NOT NULL,
  `visitor` varchar(255) NOT NULL,
  `id` int(11) NOT NULL,
  `evaluation code` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `evaluation`
--

INSERT INTO `evaluation` (`mobile name`, `processor`, `camera`, `screen`, `storage`, `battery`, `visitor`, `id`, `evaluation code`) VALUES
('', '', '', '', '', '', '', 1, '');

-- --------------------------------------------------------

--
-- Table structure for table `favorite list`
--

CREATE TABLE `favorite list` (
  `user id` int(11) NOT NULL,
  `mobile name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `mobile menu`
--

CREATE TABLE `mobile menu` (
  `id` int(11) NOT NULL,
  `mobile name` varchar(255) NOT NULL,
  `releas date` int(14) NOT NULL,
  `network` varchar(255) NOT NULL,
  `materials` varchar(255) NOT NULL,
  `mobile size` varchar(255) NOT NULL,
  `audio` varchar(255) NOT NULL,
  `microphone` varchar(255) NOT NULL,
  `processor` varchar(255) NOT NULL,
  `camera` varchar(255) NOT NULL,
  `screen` varchar(255) NOT NULL,
  `storage` varchar(255) NOT NULL,
  `ram` varchar(255) NOT NULL,
  `operating system` varchar(255) NOT NULL,
  `details` longtext NOT NULL,
  `features` mediumtext NOT NULL,
  `disadvantages` mediumtext NOT NULL,
  `battery` varchar(255) NOT NULL,
  `price Amazon` varchar(255) NOT NULL,
  ` price tredline` varchar(255) NOT NULL,
  `price be tech` varchar(255) NOT NULL,
  `price raya` varchar(255) NOT NULL,
  `price  jumia` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `mobile menu`
--

INSERT INTO `mobile menu` (`id`, `mobile name`, `releas date`, `network`, `materials`, `mobile size`, `audio`, `microphone`, `processor`, `camera`, `screen`, `storage`, `ram`, `operating system`, `details`, `features`, `disadvantages`, `battery`, `price Amazon`, ` price tredline`, `price be tech`, `price raya`, `price  jumia`) VALUES
(1, 'iPhone SE 2020', 0, '', '', '', '', '', ' سداسي النواة A13 Bionic تكنولوجيا 7 نانو\r\n', 'ا خلفية 12م.ب. / امامية 7 م.ب.', ': 4.7 بوصة بدقة HD+\r\n', '128\\256', '3جيجا رام', 'IOS 13\r\n', 'يدعم الاتصال قريب المدى الـ NFC .\r\nيأتي الهاتف بأبعاد 138.4×67.3×7.3 ملم مع وزن خفيف يقدر بـ 148 جرام .\r\nيأتي الهاتف بخامات وجودة تصنيع تأتي من الزجاج مع إطار من معدن الالمونيوم .\r\nيأتي الهاتف مقاوم للماء والغبار من بشهادة من نوع IP67 حتى متر أسفل الماء لمدة نصف ساعة .\r\nيدعم الهاتف شريحتين إتصال حيث تأتي الشريحة الأولى من نوع Nano Sim والشريحة الثانية من نوع eSim والتي سنراها في مصر قريباً .\r\nيدعم الهاتف شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nالشاشة تأتي بالأبعاد القديمة من نوع Retina IPS LCD بمساحة 4.7 إنش لتكون الشاشة أصغر من شاشة الـ iPhone 11 و تأتي بجودة الـ HD+ بدقة 750×1334 بكسل بمعدل كثافة بكسلات 326 بكسل لكل إنش وتدعم الشاشة أبعاد العرض القديمة بنسبة الـ 16:9 مع طبقة حماية من نوع Ion-strengthened glass والـ oleophobic coating فهي نفس شاشة هاتف Apple iPhone 8 السابق .\r\nالهاتف يأتي بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي :-\r\n– الإصدار الأول يأتي بذاكرة صلبة بسعة 64 جيجا بايت مع ذاكرة عشوائية بسعة 3 جيجا بايت .\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 128 جيجا بايت مع ذاكرة عشوائية بسعة 3 جيجا بايت .\r\n– الإصدار الثالث يأتي بذاكرة صلبة بسعة 256 جيجا بايت مع ذاكرة عشوائية بسعة 3 جيجا بايت .\r\n– الذاكرة الصلبة تأتي من نوع NVMe والذاكرة العشوائية من نوع LPDDR4 .\r\n– لا يدعم الهاتف إمكانية زيادة المساحة التخزينية كعادة ابل في كل هواتفها .\r\nأما عن الأداء فيأتي بمعالج ابل نفسها من نوع Apple A13 Bionic بتكنولوجيا الـ 7 نانو مع معالج رسومي من نوع Apple GPU بأربعة أنوية للعمل بكفاءة وسرعة عالية فهو نفس معالج الـ iPhone 11 والـ iPhone 11 Pro والـ iPhone 11 Pro Max .. وهذا المعالج ممتاز و هو أفضل معالج في 2019 .\r\nالكاميرا الأمامية تأتي بدقة 7 ميجا بكسل بفتحة عدسة F/2.2 مع دعم الكاميرا الأمامية إلى الجيل الثاني من الـ Smart HDR لتقديم صور أفضل .\r\nالكاميرا الخلفية تأتي بكاميرا أحادية بارزة قليلاً عن ظهر الهاتف وتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/1.8 وتدعم المثبت البصري الـ OIS والتقريب الديجتال حتى 5x مع دعم الكاميرا لعمل العزل والبورتريه أيضاً مع فلاش رباعي نوع ليد فلاش .\r\nيدعم الهاتف الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج أثناء استخدام الهاتف بصفة عامة .\r\nأما عن تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 24 و30 و60 إطار في الثانية كما يدعم التصوير الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 و60 و120 و240 إطار في الثانية .. ويتم تسجيل صوت استريو بالفيديوهات مما ينتج جودة صوت عالية للفيديوهات مع جودة صورة ممتازة كالمعتاد من أبل .\r\nيدعم سماعات ستريو .. سماعة المكالمات تعمل مع السماعة السفلية للحصول على جودة صوت ممتازة .\r\nالبلوتوث يأتي بإصدار 5.0 مع دعمه لخاصيتي الـ A2DP, LE .\r\nيدعم الواي فاي بترددات الـ a/b/g/n/ac/ax بالإضافة لدعمه إلى الـ Dual-band, hotspot .\r\nيدعم الهاتف تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS .\r\nوسائل الأمان والحماية: يدعم الهاتف مستشعر البصمة ويأتي في الجهة الأمامية ويعمل عن طريق اللمس فهو مدمج بزر القائمة الرئيسية الـ Home فهو نفس زر iPhone 8 ولكن مع افتقاده إلى الـ 3D Touch .\r\nيدعم الهاتف معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والجيروسكوب والضغط الجوي .\r\nأما عن المساعد الصوتي فيأتي بمساعد ابل المعتاد الـ Siri ويدعم جميع اللغات حتى العربية بالإضافة لدعمه إلى الـ FaceTime والـ iMessage الخاص بأبل .\r\nلا يدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن ويتم استخدام منفذ الـ USB لسماعات الاذن الـ EarPods .\r\nأما عن منفذ الـ USB فيأتي من نوع الـ Lightning القديم والمعتاد من ابل .\r\nأما عن نظام التشغيل يأتي بنظام الـ iOS 13 .\r\nأما عن البطارية بحجم 1821 مللي أمبير يتم شحنها لنسبة 50% خلال نصف ساعة وتأتي بقوة شحن 18 واط ويدعم الشحن اللاسلكي أيضاً … ولكن الشاحن المرفق مع الهاتف 5 واط فقط ويمكنك شراء شاحن 18 واط .\r\nيتوفر الهاتف باللون الأحمر وباللون الأبيض وباللون الأسود ', 'يأتي الهاتف مقاوم للماء والغبار بشكل رسمي .\r\nأرخص أيفون يمكنك الحصول عليه في 2020.\r\nيدعم التصوير الـ 4K بجودة وتفاصيل ممتازة جداً .\r\nالكاميرات تقدم أداء ممتاز كما هو متوقع عن أبل فهي تقدم أفضل الكاميرات .\r\nيمكنك شحن الهاتف خلال وقت قصير بفضل دعمه للشحن السريع والشحن اللاسلكي .\r\nيدعم مستشعر البصمة الذي افتقدناه ولم نكن نتوقع أن نراه مرة أخرى ويعمل بشكل سريع .\r\nيقدم أداء قوي جداً بفضل معالج ابل الرائد الذي رايناه مؤخراً في سلسلة الـ iPhone 11 .\r\nتمتاز ابل بدعم هواتفها من ناحية تحديثات النظام الأساسية بحد أدنى 4 سنوات بعكس جوجل سنتين فقط', 'تصميم قديم بحواف كبيرة جداً .\r\nشاشة صغيرة لا ترقي للمنافسة حالياً وكان من الأفضل أن تأتي بشاشة أكبر .\r\nلا يدعم إمكانية تركيب كارت ميموري وهذا هو المعتاد من أبل .\r\nلا يدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن فلا يمكنك شحن الهاتف وتركيب السماعات في نفس الوقت .\r\nالشاحن السريع بقوة 18 واط لا يأتي في علبة الهاتف ويجب شراؤه بشكل منفصل مثل ما حدث في ايفون 8 .\r\nيفتقد الي عدسة تصوير بزاوية واسعة .. ولكن لا بأس بذلك بسبب التسعير المنخفض من أبل .\r\nضعف البطارية مقارنتا بالمنافسين من موبايلات الأندرويد ', ' 1821 مللي أمبير\r\n', '', '', '', '', ''),
(2, 'iPhone 12', 0, '', '', '', '', '', 'سداسي النواة Apple A14 Bionic تكنولوجيا 5 نانو\r\n', ' خلفية ثنائية 12+12 / امامية 12+SL 3D\r\nد', ': 6.1 بوصة بدقة 1170x2532 بها نوتش كبير\r\n', '\\128\\256', 'رام4جيجا', 'IOS 14\r\n', 'يدعم الهاتف الاتصال قريب المدى الـ NFC .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim ومن نوع eSim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nمتانة وجودة الخامات المستخدمة في تصنيع الهاتف تأتي من الزجاج مع إطار من معدن الالمونيوم .\r\nيأتي الهاتف مقاوم للماء والغبار IP68 حتى 6 متر لمدة نصف ساعة .\r\nيتوفر الهاتف بأبعاد 146.7×71.5×7.4 ملم مع وزن 162 جرام .\r\nالشاشة تأتي بشكل النوتش الكبير وتأتي من نوع Super Retina XDR OLED بمساحة 6.1 إنش بجودة 1170×2532 بكسل بمعدل كثافة بكسلات 460 بكسل لكل إنش وتدعم خاصية الـ HDR10 وتدعم أبعاد العرض الجديدة بنسبة 5:9 مع طبقة حماية من نوع oleophobic coating مع طبقة حماية ضد الخدش فهي نفس شاشة الـ iPhone 12 Pro والتي لأول مرة نراها من ابل فلم يتم استخدام شاشة IPS مثل iPhone 11 السابق كما تدعم الشاشة تكنولوجيا الـ True Tone أيضاً .\r\nيتوفر الهاتف بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي :-\r\n– الإصدار الأول يأتي بذاكرة صلبة بسعة 64 جيجا بايت من نوع NVMe مع 4 جيجا رام .\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 128 جيجا بايت من نوع NVMe مع 4 جيجا رام .\r\n– الإصدار الثالث يأتي بذاكرة صلبة بسعة 256 جيجا بايت من نوع NVMe مع 4 جيجا رام .\r\n– لا يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري .\r\nأما عن الأداء فالهاتف يأتي بمعالج ابل الرائد الـ A14 Bionic بتكنولوجيا الـ 5 نانو مع معالج رسومي من نوع Apple GPU 4-core graphics للحصول على أفضل أداء ممكن فهو نفس الموجود في هاتفي الـ Apple iPhone 12 Pro Max والـ iPhone 12 Pro .\r\nالكاميرا الأمامية تأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.2 أما عن الكاميرا الثانية فتأتي بدقة SL 3D وهي الخاصة بالعزل وبصمة الوجه وتطلق عليها ابل مسمى الـ TrueDepth .\r\nالكاميرا الخلفية تأتي بكاميرا مزدوجة حيث تأتي الكاميرا الأولى بدقة 12 ميجا بكسل بفتحة عدسة F/1.6 وهي الكاميرا الأساسية وتدعم المثبت البصري أما عن الكاميرا الثانية فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.4 وهي الخاصة بالتصوير الواسع ويدعم الهاتف التقريب البصري حتى مرتين مع فلاش مزدوج .\r\nيدعم الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج أثناء إستخدام الهاتف بصفة عامة .\r\nتصوير الفيديوهات بجودة الـ 4K بدقة 2160 بمعدل التقاط 24 و30 و60 إطار في الثانية كما يدعم تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل 30 و60 إطار في الثانية كما تدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم التصوير الـ Slow Motion حيث يدعم التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 120 و 240 إطار في الثانية .\r\nأما عن الأمان والحماية : فالهاتف يدعم الـ Face ID لفتح الهاتف عن طريق الوجه .\r\nالسماعات الخارجية تأتي بصوت ستيريو لتقديم تجربة صوتية أفضل .\r\nكما يدعم معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والجيروسكوب والضغط الجوي .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac/ax مع دعمه إلى الـ Dual-band, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 مع دعمه لخاصيتي الـ A2DP, LE .\r\nيدعم تحديد الموقع الجغرافي الـ GPS مع دعمه لأنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BeiDou, QZSS .\r\nمنفذ الـ USB يأتي من نوع Lightning .\r\nبطارية بحجم 2815 مللي أمبير و البطارية تصمد للعمل لمدة 17 ساعة في تشغيل الفيديوهات على الهاتف وتصمد للعمل لمدة 11 ساعة لتشغيل الفيديوهات عبر الانترنت كما تصمد في تشغيل الموسيقى والصوتيات لمدة 65 ساعة .\r\nالبطارية تدعم الشحن السريع بقوة 20 واط كما يدعم الشحن اللاسلكي من نوع ( MagSafe‏ ) بقوة 15 واط .\r\nيتوفر الهاتف باللون الأسود وباللون الأبيض وباللون الأحمر وباللون الأخضر وباللون الأزرق', 'الكاميرات تقدم تجربة فريدة من نوعها ولكن ليس التطوير المطلوب والكبير مقارنتا بالجيل القديم .\r\nيدعم شبكات الاتصال الجيل الخامس الـ 5G .\r\nالهاتف يأتي مقاوم للماء والغبار بفضل شهادة الـ IP68 حتى عمق 6 متر ولمدة نصف ساعة .\r\nستضمن أنك ستحصل على أقوى أداء بفضل معالج الـ A14 Bionic .\r\nيدعم الهاتف صوت ستريو عالي و محترم .\r\nأصبح الهاتف يدعم الشحن السريع بقوة 20 واط كما يدعم الشحن اللاسلكي بقوة 15 واط .. ولكن الشاحن السلكي و اللاسلكي لا يأتوا في علبة الهاتف وستقوم بشرائهم منفصلان .\r\nشاشة كبيرة من نوع Super Retina XDR OLED تقدم تجربة فريدة من نوعها من حيث السطوع ودرجة تشبع الألوان مع دقة محترمة FHD .', 'لا جديد على التصميم فهو نفسه iPhone 11 باختلاف الفريم الذي أصبح مسطح وحاد بدون انحناءات .\r\nالشاحن وسماعات الاذن لا يأتوا بعلبة الهاتف ويتوجب عليك شرائهم منفصلين .\r\nالهاتف لا يدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن وهذا طبيعي في الهواتف الرائدة .\r\nلا تدعم الشاشة أي معدل تردد مثل الـ 90Hz أو الـ 120Hz للأسف .. كما ان شكل نوتش الشاشة عريض وقديم نسبيا .\r\nشريحة eSim ما زالت غير مدعومة في شركات الاتصال في مصر .\r\nتم تقليل حجم البطارية مقارنتا بالجيل القديم لجعل الهاتف أنحف .\r\nيعتبر iPhone 12 تطوير عن iPhone 11 في استخدام شاشة OLED أفضل بدقة أعلى مع معالج أقوى A14 مع تصميم أخف و أرفع مع كاميرا خلفية اساسية أفضل بفرق بسيط .', '2815 مللي أمبير\r\n', '', '', '', '', ''),
(3, 'iPhone 13 Mini', 0, '', '', '', '', '', ' سداسي النواة Apple A15 Bionic تكنولوجيا 5 نانو', ': خلفية ثنائية 12+12 / امامية 12+SL 3D\r\n', ': 5.4 بوصة بدقة 1080x2340 بها نوتش كبير\r\n', ':128\\256', 'رام6جيجا', 'IOS 15\r\n', 'يدعم الـ NFC .\r\nيأتي الهاتف بأبعاد 131.5×64.2×7.7 ملم مع وزن 141 جرام .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim و eSIM .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nمتانة وجودة الخامات المستخدمة في تصنيع الهاتف تأتي من الزجاج مع إطار من معدن الالمونيوم .\r\nيأتي الهاتف مقاوم للماء والغبار بشهادة الـ IP68 لتتمكن من وضع الهاتف في الماء حتى 6 متر لمدة 30 دقيقة .\r\nالشاشة تأتي من نوع Super Retina XDR OLED بمساحة 5.4 إنش بدقة 1080×2340 بكسل بمعدل كثافة بكسلات 476 بكسل لكل إنش مع دعم أبعاد العرض بنسبة 19.5:9 لعرض محتوى أكبر على شاشة الهاتف سواء أثناء مشاهدة الفيديوهات أو لعب الألعاب بالإضافة لوجود طبقة مقاومة للتبصيم والزيوت على شاشة الهاتف من نوع oleophobic coating مع زجاج مقاوم للخدش بالإضافة لدعم لخاصية الـ HDR10 والـ Dolby Vision .. مع سطوع تحت الشمس 800 شمعة واقصى سطوع 1200 شمعة .\r\nيتوفر الهاتف بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي :-\r\n– الإصدار الأول يأتي بذاكرة صلبة بسعة 128 جيجا بايت من نوع NVMe مع ذاكرة عشوائية بسعة 6 جيجا بايت .\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 256 جيجا بايت من نوع NVMe مع ذاكرة عشوائية بسعة 6 جيجا بايت .\r\n– الإصدار الثالث يأتي بذاكرة صلبة بسعة 512 جيجا بايت من نوع NVMe مع ذاكرة عشوائية بسعة 6 جيجا بايت .\r\n– لا يدعم الهاتف إمكانية زيادة المساحة التخزينية كما هو معتاد من ابل .\r\nأما عن الأداء فقد تم استخدام معالج الـ A15 Bionic بتكنولوجيا الـ 5 نانو مع معالج رسومي من نوع Apple GPU 4 Core بأربع أنوية لاداء مميز في الألعاب .\r\nالكاميرا الأمامية تأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.2 أما عن الكاميرا الثانية فتأتي بدقة SL 3D وهي الخاصة بالعزل وبصمة الوجه وتطلق عليها ابل مسمى الـ TrueDepth والتي سبق وأن رأيناها في ايفون 12 .\r\nالكاميرا الخلفية تأتي بكاميرا مزدوجة حيث تأتي الكاميرا الأولى بدقة 12 ميجا بكسل بفتحة عدسة F/1.6 وهي الكاميرا الأساسية وتدعم مستشعر جديد لتصوير أفضل تطلق عليه الـ IBIS كما ان بها خاصية التثبيت الميكانيكي لثبات أفضل والحصول على صور ليلية أفضل أما عن الكاميرا الثانية فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.4 وهي الخاصة بالتصوير الواسع بالإضافة لدعم الهاتف إلى فلاش ثنائي من نوع ليد فلاش وأعلنت الشركة أن غطاء عدسة الكاميرات يأتي من غطاء عدسة من الكريستال الياقوتي .\r\nتصوير الفيديوهات بجودة الـ 4K بدقة 2160 بمعدل التقاط 24 و25 و30 و60 إطار في الثانية الواحدة كما يدعم تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 24 و25 و30 و60 إطار في الثانية الواحدة كما تدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم التصوير الـ Slow Motion حيث يدعم التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 120 و 240 إطار في الثانية .\r\nيدعم ميكروفون إضافي لعزل الضوضاء .\r\nيدعم الهاتف السماعات الخارجية الاستيريو والتي تقدم تجربة صوتية مميزة جداً .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac/6 بالإضافة إلى دعمه إلى الـ Dual-band, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 بالإضافة إلى دعمه إلى الـ A2DP, LE .\r\nيدعم تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى الـ A-GPS, GLONASS, GALILEO, BDS, QZSS .\r\nوسائل الأمان والحماية : يدعم خاصية الـ Face ID لفتح الهاتف عن طريق الوجه والتي تعمل بمستشعر عن طريق الكاميرا الأمامية .\r\nكما يدعم معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والجيروسكوب والضغط الجوي .\r\nمنفذ الـ USB يأتي من نوع Lightning .\r\nبطارية بحجم 2438 مللي أمبير و أعلنت أبل بأن البطارية تعمل لفترة أطول بساعة ونصف من الـ iPhone 12 mini السابق .\r\nالبطارية تدعم الشحن السريع بقوة 20 واط والشحن اللاسلكي الـ MagSafe بقوة 15 واط والشحن اللاسلكي مع شواحن الـ Qi العادية بقوة 7.5 واط .\r\nيأتي بنظام تشغيل ابل الأحدث الـ iOS 15 .\r\nيتوفر الهاتف بأكثر من لون وتسميه ابل : اللون وردي، واللون الأزرق، واللون سماء الليل ( الأسود ) ، واللون ضوء النجوم ( الفضي الفاتح ) واللون الأحمر ', 'يدعم شبكات الاتصال الـ 5G .\r\nوزن الهاتف خفيف فيسهل حمله واستخدامه بيد واحدة .\r\nمقاوم للماء كالعادة .\r\nالسماعات الخارجية تأتي بصوت ستريو عالي و محترم .\r\nستحصل على أقوى أداء ممكن بفضل معالج الـ A15 Bionic المطور كلياً .\r\nأحدث نظام تشغيل IOS 15 مع ضمان تحديث النظام لفترة طويلة بعكس هواتف الأندرويد .\r\nالكاميرات تقدم تجربة ممتازة كالعادة ولكن بدون تطويرات محسوسة .\r\nشاشة Super Retina XDR OLED تقدم تجربة فريدة من نوعها من حيث السطوع ودرجة تشبع الألوان مع دقة جيدة .', 'نوتش كبير نسبياً حتى بعد ما تم تصغيره بنسبة 20% عن الجيل القديم .\r\nلا يدعم منفذ 3.5 ملم الخاص بسماعات الاذن .\r\nشريحة eSim غير مدعومة في شركات الاتصال حالياً .\r\nستحتاج إلى شراء الشاحن السريع وسماعات الاذن بشكل منفصل .\r\nشاشة صغيرة نسبياً في والتي أصبحت نادراً ما تتوفر حالياً في 2021 .\r\nكنا نتمنى لو أصبحت الشاشة بتردد أعلى ولو حتى 90 هرتز .\r\nلم يتم تطوير الهاتف بشكل كبير عن iPhone 12 Mini .', ': 2438 مللي أمبير\r\n', '', '', '', '', ''),
(4, 'Iphone 6s Plus', 0, '', '', '', '', '', ' Apple A9 ثنائي النواة 1.84 جيجا هرتز', ': 12 م ب خلفية / 5 م ب امامية\r\n', ': 5.5 بوصة بدقة ١٩٢٠ × ١٠٨٠\r\n', ':128\\64', 'رام 2 جيجا', 'IOS 9 قابل للتجديد الي IOS 10.2\r\n\r\n', 'يدعم الهاتف شبكة الجيل الرابع (4g /GSM /LTE ) ويدعم شريحة اتصال من نوع nano .\r\nوزن الهاتف192 جرام .\r\nشاشة قياس 5.5 بوصة من نوع كابستيف LED-backlit IPS LCD بجودة 1080*1920 بيكسل و كثافة 401 بيكسل لكل بوصة  تدعم 16 مليون لون ومزودة بخاصية 3D Touch display .\r\nنظام تشغيل IOS 9 قابل للتحديث الي IOS 10.2 .\r\nمعالج ثنائي النواه 1.84 جيجا هرتز من نوع Apple A9 و معالج رسومي PowerVR GT7600 سداسي النواة  .\r\nكاميرا خلفية 12 ميجا بيكسل ، بفتحة عدسة f/2.2 , ضبط تلقائي للصورة، فلاش ثنائي LED و يصور مقاطع فيديو بجودة  2160p@30fps او  1080p@60fps او 1080p@120fps او 720p@240fps .\r\nكاميرا امامية5 ميجا بيكسل بفتحة عدسة f/2.2 .\r\nذاكرة داخلية  16 او 32 او 64 او 128 جيجا بايت ولايدعم كارت ذاكرة خارجي  .\r\n2 جيجا بايت رام .\r\nقاريء بصمة الاصابع .\r\nبطارية2750 مللي امبير غير قابلة للنزع', 'جسم معدني بالكامل .\r\nشاشة  حجم 5.5 بوصة full HD و تدعم خاصية 3D Touch display .\r\nذاكرة داخلية  16 او 32 او 64 او 128 جيجا بايت تدعم 2جيجا بايت رام .\r\nمعالج ثنائي النواه 1.84 جيجا هرتز من نوع Apple A9 و معالج رسومي PowerVR GT7600 سداسي النواة تجعل الهاتف سريع جدا .\r\nكاميرا خلفية 12 ميجا بيكسل و امامية 5 ميجا بيكسل  تجعله مميز في التقاط صور السيلفي .\r\nنظام تشغيل  IOS 9 قابل للتحديث الي IOS 10.2 .\r\nقاريء بصمة الاصابع .\r\nبطارية 2750 مللي امبير .\r\n', 'قيل الوزن .\r\nبطارية  غير قابلة للنزع .\r\nلايدعم الهاتف بطاقة الذاكرة الخارجية microSD .\r\nلا يدعم خاصية NFS الا عند استخدام Apple Pay .\r\nلايوجد شحن لاسلكي او اشعة تحت حمراء .\r\nلا يوجد FM راديو .\r\nالكاميرا الخلفية بارزة عن الهاتف مما يجعلها معرضة للخدش و التجريح بسهولة .\r\nسعر الهاتف غالي بعض الشئ عند مقارنته بالهواتف الاخري التي تحمل نفس المواصفات', ': 2750 مللي امبير\r\n', '', '', '', '', ''),
(5, 'Oppo A16K', 0, '', '', '', '', '', 'ثماني النواة Helio G35 تكنولوجيا 12 نانو', 'خلفية 13 م.ب. / امامية 5 م.ب.', '6.52 بوصة بدقة FHD+ بها نوتش صغير', '32 جيجا ', ' 3 جيجا رام', 'اندرويد 11', 'يدعم شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nيأتي الهاتف بأبعاد 164×75.4×7.9 ملم مع وزن 175 جرام .\r\nمتانة وجودة الخامات المستخدمة في الهاتف تأتي من البلاستيك بالكامل وهذا المعتاد من اوبو في الفئة الاقتصادية .\r\nالشاشة تأتي بشكل النوتش في منتصف الشاشة وتأتي من نوع IPS LCD وتأتي بمساحة 6.52 إنش بجودة الـ 720×1600 بكسل بمعدل كثافة بكسلات 269 بكسل لكل إنش مع دعم الشاشة لأبعاد العرض بنسبة الـ 20:9 لعرض محتوى أكبر على شاشة الهاتف أثناء الاستخدام ومشاهدة الفيديوهات بالإضافة لوجود طبقة حماية من نوع Corning Gorilla Glass الجيل الثالث .\r\nيأتي بذاكرة صلبة بسعة 32 جيجا بايت من نوع eMMC 5.1 مع ذاكرة عشوائية 3 جيجا بايت .\r\n– يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت الميموري .\r\nالأداء يأتي الهاتف بمعالج من نوع Helio G35 بتكنولوجيا الـ 12 نانو مع معالج رسومي من نوع PowerVR GE8320 فهو نفس المعالج الموجود في الـ Oppo A55 وهاتف Infinix Hot 11 Play .\r\nالكاميرا الأمامية تأتي بدقة 5 ميجا بكسل بفتحة عدسة F/2.4 .\r\nالكاميرا الخلفية تأتي بارزة قليلاً عن ظهر الهاتف وتأتي بدقة 13 ميجا بكسل بفتحة عدسة F/2.2 مع فلاش أحادي من نوع ليد فلاش .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac كما يدعم الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 بالإضافة لدعمه إلى الـ A2DP, LE, aptX .\r\nيدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nيدعم الهاتف تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS .\r\nوسائل الأمان والحماية التي يدعمها الهاتف : يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nيدعم الهاتف مستشعرات التسارع والقرب .\r\nمنفذ الـ USB يأتي من نوع microUSB 2.0 مع دعمه لخاصية الـ OTG .\r\nالبطارية تأتي بسعة 4230 مللي أمبير مع قوة شحن 10 واط .\r\nيأتي الهاتف بنظام تشغيل اندرويد 11 مع واجهة اوبو الـ ColorOS 11.1 .\r\nيتوفر الهاتف باللون الأسود وباللون الأزرق', 'المعالج يقدم أداء جيد في الفئة الاقتصادية .\r\nتصميم شيك و خفيف .\r\nيدعم شريحتين وكارت ميموري في نفس الوقت .\r\nبطارية مقبولة .. ليست الأكبر ولكن تكفي للعمل لفترة طويلة خلال اليوم .\r\nشاشة كبيرة بشكل النوتش مع وجود طبقة حماية يعيبها فقط دقتها المنخفضة ', 'لا يدعم مستشعر البصمة .\r\nمنفذ الـ USB من النوع القديم .\r\nسماعات الاذن غير مرفقة بعلبة الهاتف .\r\nستحتاج لفترة طويلة لشحن البطارية بالكامل .\r\nلا يقدم جديد بالمقارنة مع الإصدار السابق الـ Oppo A15 .\r\nلا يدعم الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج ', '4230 مللي أمبير', '', '', '', '', ''),
(6, 'Oppo A94', 0, '', '', '', '', '', 'ثماني النواة Helio P95 تكنولوجيا 12 نانو', ' خلفية رباعية 48+8+2+2 م.ب. / امامية 32 م.ب', '6.43 بوصة بدقة FHD+ بها ثقب صغير', 'ثماني النواة Helio P95 تكنولوجيا 12 نانو', ' 8 جيجا رام', 'اندرويد 11', 'هذه هي النسخة الـ 4G من الهاتف وهي الموجودة في مصر بشكل رسمي اما النسخة الـ 5G من الهاتف فلن تأتي الي مصر .\r\nيأتي الهاتف بأبعاد 160.1×73.2×7.8 ملم مع وزن 172 جرام .\r\nيدعم تشغيل شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nمتانة وجودة الخامات التي تم استخدامها في تصنيع الهاتف تأتي من البلاستيك اللامع كعادة أوبو في معظم هواتفها .\r\nالشاشة تأتي بشكل الثقب وتأتي من نوع AMOLED بمساحة 6.43 إنش بجودة الـ FHD+ بدقة 1080×2400 بكسل بتردد 60 هرتز بمعدل كثافة بكسلات 409 بكسل لكل إنش مع دعم الشاشة لأبعاد العرض بنسبة 20:9 لعرض محتوى أكبر على شاشة الهاتف سواء اثناء مشاهدة الفيديوهات أو لعب الألعاب حيث تحتل الشاشة من الواجهة الأمامية نسبة 90.80% فقد تم استغلال الحواف بشكل مقبول جداً بخلاف الحافة السفلية .\r\nيأتي الهاتف بذاكرة صلبة بسعة 128 جيجا بايت مع ذاكرة عشوائية بسعة 8 جيجا بايت من نوع LPDDR4X .\r\nيدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري حتى سعة 512 جيجا بايت في منفذ منفصل .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة ميديا تيك من نوع Helio P95 بتكنولوجيا الـ 12 نانو مع معالج رسومي من نوع PowerVR GM9446 فهو نفس معالج هاتف أوبو السابق الـ Oppo A93 والـ Oppo Reno 3 Pro بالإضافة لدعم المعالج لخاصية الـ Hyper Engin Gaming لمحاولة تعزيز الأداء لتحصل على أفضل تجربة أثناء اللعب .\r\nالكاميرا الأمامية تأتي بدقة 32 ميجا بكسل بفتحة عدسة F/2.4 .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية بارزة قليلاً عن ظهر الهاتف حيث تأتي الكاميرا الأولى بدقة 48 ميجا بكسل بفتحة عدسة F/1.7 وهي الكاميرا الأساسية وتأتي الكاميرا الثانية بدقة 8 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع أما عن الكاميرا الثالثة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بالتصوير الماكرو أما عن الكاميرا الرابعة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بعمل العزل والبورتريه بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nيدعم الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج أثناء استخدام الهاتف سواء في التحدث أو التسجيل أو التصوير … الخ .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة كما يدعم الهاتف التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة مع تدعم المثبت الالكتروني الـ EIS كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم تصوير الحركة البطيئة الـ Slow Motion بجودة الـ FHD بدقة 1080 بمعدل التقاط 120 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 240 إطار في الثانية .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac بالإضافة لدعمه إلى الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.1 بالإضافة لدعمه إلى الـ A2DP, LE, aptX HD .\r\nيدعم الهاتف تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS, QZSS .\r\nوسائل الأمان والحماية المدعومة بالهاتف : يدعم الهاتف مستشعر البصمة ويأتي مدمج بالشاشة كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nيدعم الهاتف معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والجيروسكوب الخاص بتشغيل نظارات الواقع الافتراضي الـ VR على هاتفك .\r\nيدعم الهاتف منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nأما عن منفذ الـ USB فيأتي من النوع الأحدث الـ Type C مع دعمه لخاصية الـ OTG .\r\nالبطارية تأتي بسعة 4310 مللي أمبير مع دعمها للشحن السريع بقوة 30 واط .\r\nنظام التشغيل يأتي بأندرويد 11 مع واجهة اوبو الأحدث الـ ColorOS 11.1 .\r\nيتوفر الهاتف باللون البنفسجي الخيالي وباللون الأسود الليلي', 'يدعم تصوير الفيديوهات الـ 4K .\r\nوزن خفيف مع تخانة مقبولة تجعله سهل في استخدامه بيد واحدة .\r\nيمكنك استخدام شريحتين وكارت ميموري في نفس الوقت .\r\nشاشة أموليد بشكل الثقب تقدم أداء مميز جداً من حيث السطوع أو درجة تشبع الألوان ولكن ينقصها تردد أعلى .\r\nبطارية كبيرة السعة مع شحن سريع بقوة 30 واط يمكنك من شحن هاتفك خلال وقت قصير .\r\nشبكات اتصال قوية كعادة أوبو .', 'لا يدعم الـ NFC بعكس الهواتف المنافسة .\r\nالحافة السفلية للشاشة كبيرة وكان من الأفضل أن يتم تقليلها .\r\nالمعالج ليس الأقوى و ليس الأسوأ ولكن كان يحتاج الهاتف الي معالج أقوى لينافس بشكل أكبر .\r\nتفتقد الشاشة إلى معدلات التردد الأعلى مثل الـ 90Hz أو الـ 120Hz .\r\nكنا نطمح أن يأتي بصوت ستيريو مثل الهواتف المنافسة .\r\nبسبب قدومه من البلاستيك اللامع فالهاتف معرض للتبصيم والخدش بسهولة .\r\nللأسف لم يتم تطوير جذري في الهاتف فهو نفسه الـ Oppo A93 بخلاف الكاميرا الأمامية وسعة البطارية وقدرة الشحن فقط .\r\nسعر مرتفع ولا يعد الهاتف أفضل اختيار بسعره فيوجد هواتف منافسة بمواصفات أقوى و أوبو نفسها لديها Reno 4 بسعر متقارب و معالج أفضل .', ' 4310 مللي أمبير', '', '', '', '', ''),
(7, 'Oppo Find X3 Pro', 0, '', '', '', '', '', 'ماني النواة Snapdragon 888 تكنولوجيا 5 نانو', 'خلفية رباعية 50+13+50+3 م.ب. / امامية 32 م.ب.', '6.7 بوصة بدقة QHD+ بها ثقب صغير', '256 جيجا ', '12 جيجا رام', 'اندرويد 11', 'يدعم الهاتف التقارب اللاتلامسي الـ NFC .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim والـ eSIM .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nيأتي الهاتف بأبعاد 163.6x74x8.26 ملم مع وزن يقدر بـ 193 جرام .\r\nيأتي الهاتف مقاوم للماء والغبار بشهادة الـ IP68 حتى متر ونصف أسفل الماء لمدة 30 دقيقة .\r\nمتانة وجودة الخامات التي تم استخدامها في تصنيع الهاتف تأتي من الزجاج مع إطار من معدن الالمونيوم .\r\nالشاشة تأتي بشكل الثقب وتأتي من نوع LTPO AMOLED منحنية من الجوانب وتأتي بمساحة 6.7 بوصة بجودة الـ QHD+ بدقة 3216×1440 بكسل بمعدل كثافة بكسلات 525 إنش مع وجود طبقة حماية من نوع Corning Gorilla Glass الجيل الخامس بالإضافة لدعم الشاشة لمعدل التردد الأعلى الـ 120Hz لتحصل بذلك على أداء مميز بالأخص أثناء الألعاب كما يدعم خاصية الـ HDR10+ وتحتل الشاشة نسبة 92.7% من الواجهة الأمامية مع دعمها لابعاد العرض بنسبة 20:9 لعرض محتوى أكبر على الشاشة سواء أثناء مشاهدة الفيديوهات أو لعب الألعاب … الخ .\r\nأما عن الأداء فالهاتف يأتي بمعالج شركة كوالكم الرائد من نوع Snapdragon 888 بتكنولوجيا 5 نانو مع معالج رسومي من نوع Adreno 660 فهو نفس المعالج الموجود الذي رأيناه مسبقاً في هاتف الـ Xiaomi Mi 11 .\r\nيأتي بذاكرة صلبة بسعة 256 جيجا بايت من نوع UFS 3.1 مع ذاكرة عشوائية بسعة 12 جيجا بايت من نوع LPDDR5X .\r\n– للأسف لا يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري .\r\nالكاميرا الأمامية تأتي بدقة 32 ميجا بكسل بفتحة عدسة F/2.4 .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية حيث تأتي الكاميرا الأولى بدقة 50 ميجا بكسل بفتحة عدسة F/1.8 وتدعم المثبت البصري الـ OIS بمستشعر من نوع Sony IMX766 وهي الكاميرا الأساسية أما عن الكاميرا الثانية فتأتي بدقة 13 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بالزوم وتدعم الزوم الحقيقي 2X ويصل ديجتال حتى 20X أما عن الكاميرا الثالثة فتأتي بدقة 50 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع بمستشعر من نوع Sony IMX766 أما عن الكاميرا الرابعة فتأتي بدقة 3 ميجا بكسل بفتحة عدسة F/3.0 وهي الخاصة بالتصوير الميكروسكوب وتقوم بتكبير الاشياء حتى 60X .. مع فلاش أحادي من نوع ليد فلاش .\r\nيدعم الهاتف الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج أثناء استخدام الهاتف بصفة عامة .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 30 و60 إطار في الثانية كما يدعم التصوير بجودة الـ FHD بدقة 1080 بمعدل التقاط 30 و60 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 و60 إطار في الثانية كما يدعم الهاتف التصوير الـ Slow Motion بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 240 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 480 إطار في الثانية مع فلاش أحادي من نوع ليد فلاش .\r\nالسماعات الخارجية تأتي بصوت ستيريو لتحصل على تجربة متميزة .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac/6e كما يدعم الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.2 بالإضافة لدعمه إلى الـ A2DP, LE, aptX HD .\r\nيدعم تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ Dual-band A-GPS, GLONASS, BDS, GALILEO, QZSS .\r\nوسائل الأمان والحماية : يدعم الهاتف مستشعر البصمة ويأتي مدمج بالشاشة كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nيدعم الهاتف معظم المستشعرات مثل التسارع والقرب والبوصلة وعداد الخطى ودرجة حرارة اللون والجيروسكوب الخاص بنظارات الواقع الافتراضي الـ VR.\r\nمنفذ الـ USB يأتي من النوع الأحدث الـ Type C كما يدعم خاصية الـ OTG .\r\nالبطارية تأتي بسعة 4500 مللي امبير وتدعم الشحن السريع بقوة 65 واط تكنولوجيا الـ SuperVOOC 2.0 والشحن اللاسلكي بقوة 30 واط والشحن اللاسلكي العكسي بقوة 10 واط .\r\nيأتي الهاتف بنظام تشغيل اندرويد 11 مع واجهة أوبو الـ ColorOS 11.2 .\r\nيأتي بألوان .. اللون الأسود اللامع (زجاج لامع) واللون الأزرق (زجاج Anti Glare وهو الزجاج المطفي الغير لامع)', 'يأتي مقاوم للماء والغبار .\r\nوزن الهاتف مقبول جداً عن الجيل القديم .\r\nيدعم شبكات الاتصال الجيل الخامس الـ 5G .\r\nخامات رائدة مع تقفيل ممتاز فهذه السلسلة تعد الفلاج شيب الخاصة بـ أوبو .\r\nيدعم الشحن السريع بقوة 65 واط والشحن اللاسلكي والشحن اللاسلكي العكسي .\r\nستحصل على أقوى أداء ممكن بفضل معالج كوالكم الرائد حتى في الألعاب الثقيلة .\r\nسماعات ستيريو لتحصل على تجربة صوتية مميزة وصوت مجسم بشكل مميز .\r\nكاميرات أكثر من ممتازة فلقد تم تطوير الكاميرات عدا الكاميرا الزوم التي أصبحت أقل .\r\nشاشة اموليد 120Hz بدقة QHD+ مع انحناء بسيط من الاطراف تقدم تجربة مميزة سواء من حيث الألوان أو السطوع .', 'هواتف سلسلة الـ Find X مرتفعة السعر .\r\nشكل تصميم و بروز الكاميرا الخلفية غريب ولن تعتاد عليه بسهولة .\r\nلا يدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nلا يدعم التصوير الـ 8K بعكس الـ S21 Ultra والـ Mi 11 .\r\nلا يدعم زيادة المساحة التخزينية عن طريق كارت ميموري ولكن لا مشكلة فمساحة الهاتف كبيرة و معظم الهواتف الرائدة لا تدعم تركيب كارت ميموري .\r\nالكاميرا الزوم أصبحت بمدى 20X فقط بعد أن كانت حتى 60X في Find X2 Pro .\r\nكالعادة معالج سناب دراجون 888 يعاني من سخونة زائدة عن الأجيال القديمة', '4500 مللي أمبير', '', '', '', '', ''),
(8, 'Oppo A73', 0, '', '', '', '', '', 'ثماني النواة Snapdragon 662 تكنولوجيا 11 نانو', ' خلفية رباعية 16+8+2+2 م.ب. / امامية 16 م.ب', ' 6.44 بوصة بدقة FHD+ بها نوتش صغير', '128 جيجا', '6 جيجا رام', ' اندرويد 10', 'يدعم الراديو الـ Fm .\r\nيأتي الهاتف بأبعاد 159.8×72.9×7.45 ملم مع وزن يقدر بـ 163 جرام .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nالخامات من البلاستيك كالمعتاد من أوبو واللون الأزرق من الهاتف يأتي بملمس واحساس الجلد .\r\nالشاشة تأتي بشكل النوتش على هيئة الـ Water Drop وتأتي الشاشة من نوع AMOLED بمساحة 6.44 بجودة الـ FHD+ بدقة 1080×2400 بكسل بمعدل كثافة بكسلات 409 بكسل لكل إنش بالتردد العادي الـ 60 هرتز مع طبقة حماية من نوع Corning Gorilla Glass الجيل الثالث مع دعم الشاشة لأبعاد العرض الجديدة بنسبة 20:9 لعرض محتوى أكبر على شاشة الهاتف سواء أثناء مشاهدة الفيديوهات أو لعب الألعاب وأعلنت الشركة بأن الشاشة تحتل نسبة 90.7% من الواجهة الأمامية للهاتف مع دعم الشاشة لخاصية الـ Always on Display .\r\nيتوفر الهاتف بذاكرة صلبة بسعة 128 جيجا بايت مع ذاكرة عشوائية بسعة 6 جيجا بايت من نوع LPDDR4X .\r\nيدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري في منفذ منفصل .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة كوالكم من نوع Snapdragon 662 بتكنولوجيا الـ 11 نانو وهو نفس المعالج الموجود في هاتف الـ Realme 7i أما عن المعالج الرسومي فيأتي من نوع Adreno 610 .\r\nالكاميرا الأمامية تأتي بدقة 16 ميجا بكسل بفتحة عدسة F/2.0 بمستشعر من نوع Sony IMX471 .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية حيث تأتي الكاميرا الأولى بدقة 16 ميجا بكسل بفتحة عدسة F/2.2 بمستشعر من نوع OV16A10 وهي الكاميرا الأساسية أما عن الكاميرا الثانية فتأتي بدقة 8 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع أما عن الكاميرا الثالثة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 للماكرو أما عن الكاميرا الرابعة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي للعزل بالإضافة إلى فلاش من نوع ليد فلاش .\r\nيدعم الهاتف الميكروفون الثانوي الخاص بعزل الضوضاء والضجيج أثناء استخدام الهاتف بصفة عامة .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية بالإضافة لدعمه للتصوير الـ Slow Motion بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 120 إطار في الثانية الواحدة مع دعم الكاميرات للتثبيت الالكتروني الـ EIS .\r\nيدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nيدعم الواي فاي بترددات الـ a/b/g/n/ac بالإضافة إلى دعمه إلى الـ dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.1 كما يدعم الـ A2DP, LE, aptX .\r\nيدعم الهاتف تحديد الموقع الجغرافي الـ GPS مع دعمه لأنظمة الملاحة الأخرى الـ A-GPS, GLONASS, GALILEO, BDS .\r\nوسائل الأمان والحماية الموجودة في الهاتف : يدعم مستشعر البصمة ويأتي أسفل الشاشة كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nمنفذ الـ USB يأتي من النوع الأحدث الـ Type C مع دعمه لخاصية الـ OTG لتشغيل أي USB Driver على هاتفك .\r\nالبطارية تأتي بسعة 4015 مللي أمبير وتدعم الشحن السريع بقوة 30 واط .\r\nيأتي مع نظام تشغيل اندرويد 10 مع واجهة اوبو الأحدث الـ ColorOS 7.2 .\r\nيتوفر الهاتف باللون الأزرق ( الكحلي ) وباللون الفضي ( الأبيض ) ', 'يدعم الشحن السريع بقوة 30 واط .\r\nيدعم الهاتف تشغيل شريحتين وكارت ميموري في نفس الوقت .\r\nوزن خفيف مع تصميم مميز من أوبو .\r\nشاشة AMOLED تقدم أداء مميز .\r\nبصمة مدمجة بالشاشة سريعة وعملية .\r\nكاميرا سيلفي مميزة من أوبو كالعادة .\r\nالذاكرة الصلبة والذاكرة العشوائية كبيرة جداً فهي أكثر من كافية لجميع ملفاتك وتطبيقاتك', 'لا يدعم التصوير بجودة الـ 4K بعكس المنافسين .\r\nالكاميرا الخلفية ليست الأقوى في الفئة السعرية من حيث الدقة .\r\nحجم بطارية الهاتف ليس الأكبر ولكن الحجم الصغير ساعد على جعل الهاتف نحيف و خفيف .\r\nالمعالج ما زال يقدم أداء مقبول ولكنه ليس الأقوى حالياً في فئته السعرية .. ولكنه غير مناسب للألعاب بشكل كبير .', '4015 مللي أمبير', '', '', '', '', ''),
(9, 'Samsung Galaxy S22 Ultra 5G', 0, '', '', '', '', '', 'Samsung Galaxy S22 Ultra 5G', ': خلفية رباعية 108+10+10+12 م.ب. / امامية 40 م.ب.\r\n', ' 6.5 بوصة بدقة HD+ بها نوتش صغير', '64/128', '4 جيجا رام', ' اندرويد 11', 'يدعم الهاتف الراديو الـ Fm .\r\nيأتي الهاتف بأبعاد 164×75.9×9.7 ملم مع وزن 221 جرام .\r\nيدعم شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nمتانة وجودة الخامات التي تم استخدامها في تصنيع الهاتف تأتي من البلاستيك بالكامل سواء الظهر أو الإطار مع نقش مميز في ظهر الهاتف ليكون مقاوم للتبصيم بأكبر قدر ممكن .\r\nالشاشة تأتي بشكل النوتش على هيئة الـ Water Drop من نوع PLS IPS بمساحة 6.5 إنش بجودة الـ HD+ بدقة 720×1600 بكسل بمعدل كثافة 270 بكسل لكل إنش مع تردد 90 هرتز مع دعم الشاشة لأبعاد عرض بنسبة 20:9 لعرض محتوى أكبر على شاشة الهاتف .\r\nالذاكرة الصلبة تأتي بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي :-\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 64 جيجا بايت من نوع eMMC 5.1 مع ذاكرة عشوائية بسعة 4 جيجا بايت .\r\n– الإصدار الثالث يأتي بذاكرة صلبة بسعة 128 جيجا بايت من نوع eMMC 5.1 مع ذاكرة عشوائية بسعة 4 جيجا بايت .\r\n– يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري في منفذ منفصل .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة اكسنوس من نوع Exynos 850 بتكنولوجيا الـ 8 نانو مع معالج رسومي من نوع Mali-G52 فهو نفس المعالج الذي رايناه مسبقاً في هاتف الـ Samsung Galaxy A21s .\r\nالكاميرا الأمامية تأتي بدقة 8 ميجا بكسل بفتحة عدسة F/2.2 .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية حيث تأتي الكاميرا الأولى بدقة 48 ميجا بكسل بفتحة عدسة F/2.0 وهي الكاميرا الأساسية أما عن الكاميرا الثانية فتأتي بدقة 5 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع أما عن الكاميرا الثالثة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بالتصوير الماكرو اما عن الكاميرا الرابعة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بعمل العزل والبورتريه بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية .\r\nالواي فاي يأتي بترددات الـ b/g/n كما يدعم خاصيتي الـ Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 مع دعمه لخاصية الـ A2DP .\r\nيدعم تحديد الموقع الجغرافي الـ GPS بالإضافة لدعمه لأنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS لتحديد الموقع الجغرافي بشكل أكثر دقة .\r\nوسائل الأمان والحماية يدعم الهاتف مستشعر البصمة ويأتي مدمج بزر الباور كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nبالإضافة لدعمه للمستشعرات الأخرى مثل التسارع والقرب .\r\nيدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nأما عن منفذ الـ USB فيأتي من نوع Type C .\r\nالبطارية تأتي بسعة 5000 مللي امبير مع شحن بقوة 15 واط .\r\nيأتي الهاتف بنظام تشغيل أندرويد 11 مع واجهة سامسونج المخففة الـ One UI Core 3.1 .\r\nيتوفر الهاتف باللون الأزرق و الأسود و الأخضر', 'منفذ الـ USB يأتي من النوع الأحدث الـ Type C .\r\nبطارية كبيرة تكفي للعمل لفترة طويلة خلال اليوم حتى مع الاستخدام المكثف .\r\nالشحن يأتي بقوة 15 واط ليمكنك من شحن البطارية خلال وقت مقبول ولكن كنا نطمح أن يأتي أقوى من ذلك لتتناسب مع سعة البطارية .\r\nبالرغم أن الهاتف اقتصادي الا ان شاشة الهاتف داعمة لمعدل تحديث مرتفع 90 هرتز .\r\nالكاميرا الخلفية تقدم اداء مقبول ولكن في الاضاءات المرتفعة فقط و يقل الاداء في التصوير الليلي .\r\nيدعم الهاتف إمكانية استخدام شريحتين إتصال وكارت ميموري في نفس الوقت', 'لا يوجد لمبة اشعارات للأسف .\r\nالشاشة تأتي بجودة HD+ فقط مع انخفاض حدة التفاصيل على الشاشة .\r\nالحافة السفلية لشاشة الهاتف ما زالت كبيرة ولم يتم العمل على جعلها أفضل .\r\nلا يأتي مع الهاتف جراب ولا سماعة أذن في العلبة .\r\nتخانة كبيرة و وزن كبير بسبب البطارية الضخمة .\r\nاداء المعالج ليس الأقوى ولكنه معالج مقبول و موفر جدا لاستهلاك البطارية .\r\nيأتي الهاتف بنسخة مخففة من واجهة سامسونج مما يعني انك ستفقد بعض المميزات ولكن تخفيف الواجهة سيحسن قليلا من الاداء .', '5000 مللي أمبير', '', '', '', '', ''),
(10, 'Samsung Galaxy A52s 5G', 0, '', '', '', '', '', ' ثماني النواة Snapdragon 778G 5G تكنولوجيا 6 نانو\r\n', 'الكاميرا: خلفية رباعية 64+12+5+5 م.ب. / امامية 32 م.ب.\r\n', ': 6.5 بوصة بدقة FHD+ بها ثقب صغير\r\n', 'التخزين \\256', '8 جيجا رام', ': اندرويد 11\r\n', 'يدعم خاصية الـ NFC .\r\nيأتي الهاتف بأبعاد 159.9×75.1×8.4 ملم مع وزن 189 جرام .\r\nيأتي الهاتف مقاوم للماء بشهادة IP67 حتى 1 متر لمدة نصف ساعة .\r\nيدعم شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nمتانة وجودة الخامات المستخدمة في تصنيع الهاتف تأتي من البلاستيك في ظهر الهاتف كما هو معتاد من سامسونج في معظم هواتفها في الفئة المتوسطة .\r\nالشاشة تأتي على هيئة الثقب في منتصف الشاشة وتأتي من نوع Super AMOLED بمساحة 6.5 إنش بجودة الـ FHD+ بدقة 1080×2400 بكسل بمعدل كثافة بكسلات 405 بكسل لكل إنش بالإضافة إلى دعم الشاشة لمعدل التردد الأعلى الـ 120Hz مع وجود طبقة حماية من نوع Corning Gorilla Glass 5 مع دعم الشاشة لأبعاد العرض بنسبة 20:9 لعرض محتوى أكبر على شاشة الهات .\r\nيتوفر الهاتف بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي فيما يلي :-\r\n– الإصدار الأول يأتي بذاكرة صلبة بسعة 128 جيجا بايت UFS 2.1 مع ذاكرة عشوائية بسعة 8 جيجا بايت .\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 256 جيجا بايت UFS 2.1 مع ذاكرة عشوائية بسعة 8 جيجا بايت .\r\n– يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري ويتم وضعه مكان الشريحة الثانية .\r\nأما بالنسبة للأداء فالهاتف يأتي بمعالج من شركة كوالكم من نوع Snapdragon 778G 5G بتكنولوجيا 6 نانو مع معالج رسومي من نوع Adreno 642L فهو نفس المعالج هاتف Honor 50 وهاتف Realme GT Master .\r\nالكاميرا الأمامية تأتي بدقة 32 ميجا بكسل بفتحة عدسة F/2.2 مع دعم تصوير فيديوهات سيلفي بجودة 4K .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية حيث تأتي الكاميرا الأولى بدقة 64 ميجا بكسل بفتحة عدسة F/1.8 وهي الكاميرا الأساسية تدعم المثبت البصري الـ OIS أما عن الكاميرا الثانية فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع أما عن الكاميرا الثالثة فتأتي بدقة 5 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بالتصوير الماكرو أما عن الكاميرا الرابعة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بعمل العزل والبورتريه بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة كما يدعم التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 و60 إطار في الثانية الواحدة .\r\nيدعم ميكروفون إضافي لعزل الضوضاء .\r\nالسماعات الخارجية تأتي بصوت ستيريو .\r\nيدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nالواي فاي يأتي بترددات الـ a/b/g/n/ac كما يدعم الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 كما يدعم خاصيتي الـ A2DP, LE .\r\nيدعم تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى الـ A-GPS, GLONASS, GALILEO, BDS, QZSS .\r\nوسائل الأمان والحماية : يدعم الهاتف مستشعر البصمة ويأتي أسفل الشاشة كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nيدعم الهاتف معظم المستشعرات الأخرى حيث يدعم مستشعر التسارع والقرب والبوصلة والجيروسكوب .\r\nمنفذ الـ USB يأتي من النوع الأحدث الـ Type C كما يدعم خاصية الـ OTG .\r\nالبطارية تأتي بسعة 4500 مللي امبير كما يدعم الشحن السريع بقوة 25 واط ( الشاحن المرفق في العلبة 15 واط ) .\r\nيأتي الهاتف بنظام تشغيل اندرويد 11 مع واجهة سامسونج الـ One UI 3.1 .\r\nيتوفر الهاتف باللون الأسود وباللون الاخضر وباللون البنفسجي وباللون الأبيض', 'يأتي الهاتف مقاوم للماء والغبار بشهادة IP67 ( مقاوم للماء العذب فقط فيما معناه مقاومة طرطشة الماء ) ,\r\nالمعالج يقدم أداء قوي فهو معالج اداءه يقترب من اداء المعالجات الرائدة .\r\nسماعات خارجية بصوت ستيريو لتحصل على تجربة صوتية متميزة .\r\nكاميرا خلفية تقدم أداء متميز بالإضافة لدعمها إلى المثبت البصري الـ OIS .\r\nيدعم مدخل الـ 3.5 ملم الذي نفتقده في هذه الفئة السعرية .\r\nشاشة كبيرة بشكل الثقب من نوع Super AMOLED بألوان ممتازة وسطوع مميز وبدقة FHD+ كما تدعم معدل التحديث الأعلى الـ 120Hz .', 'لم نجد سماعات الاذن مرفقة بعلبة الهاتف .\r\nتم استخدام نفس تصميم الـ Samsung A52 بدون أي تعديل مع نفس الخامات البلاستيكية .\r\nلن تتمكن من استخدام شريحتين وكارت ميموري في نفس الوقت ولكن دعم كارت الميموري في حد ذاته ميزه نفتقدها في هواتف كثيرة في هذه الغئة السعرية .\r\nما زالت سامسونج متأخرة في سرعات الشحن كما أن علبة الهاتف تأتي بشاحن 15 واط فقط .\r\nالبصمة تحت الشاشة ليست الأسرع ولكنها مقبولة .\r\nضعف استقبال شبكة الواي فاي في حالة أن الراوتر بعيد عن الهاتف', ': 4500 مللي أمبير\r\n', '', '', '', '', '');
INSERT INTO `mobile menu` (`id`, `mobile name`, `releas date`, `network`, `materials`, `mobile size`, `audio`, `microphone`, `processor`, `camera`, `screen`, `storage`, `ram`, `operating system`, `details`, `features`, `disadvantages`, `battery`, `price Amazon`, ` price tredline`, `price be tech`, `price raya`, `price  jumia`) VALUES
(11, 'Samsung Galaxy Z Fold 3', 0, '', '', '', '', '', 'ثماني النواة Snapdragon 888 5G تكنولوجيا 5 نانو', 'خلفية ثلاثية 12+12+12 م.ب. / امامية 16 م.ب.+10 م.ب', '7.6 بوصة و 6.2 بوصة', '256 جيجا', 'مع 12 جيجا رام', 'اندرويد 11', 'يدعم الهاتف الـ NFC .\r\nيدعم الهاتف القلم المخصص للكتابة الـ S Pen ( ولكن ستحتاج إلى شراؤه بشكل منفصل ) ويعمل في الشاشة الكبيرة أما الشاشة في حالة الطي لن يعمل القلم في شاشة الغلاف .. يوجد نوعين من الـ S-Pen ألأول S-Pen Fold وهو لا يدعم بلوتوث ولا يدعم Air Actions ويتم بيعه مع جراب مخصص للقلم .. النوع الأخر S-Pen Pro وهو يدعم بلوتوث ويدعم Air Actions ولكن يتم بيعه منفردا فستحتاج الي شرائه و شراء جراب لوضعه به !\r\nأما عن أبعاد الهاتف فيأتي :-\r\n– في حالة عدم الطي تصبح أبعاد الهاتف بأبعاد 158.2×128.1×6.4 ملم .\r\n– وفي حالة الطي تصبح أبعاد الهاتف بأبعاد 158.2×67.1×14.4-16 ملم .\r\nأما بالنسبة للوزن فيأتي بوزن 271 جرام فهو ثقيل وستحتاج إلى بعض الوقت للاعتياد عليه .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nالهاتف يأتي مقاوم للماء العذب بشهادة IPX8 حتى متر ونصف أسفل الماء للمدة 30 دقيقة .\r\nمتانة وجودة الخامات المستخدمة في تصنيع الهاتف تأتي من الزجاج في ظهر الهاتف مع إطار من الالمونيوم مع حماية على الظهر Corning Gorilla Glass Victus .\r\nالشاشة الكبيرة تأتي كاملة فالكاميرا الأمامية أسفل الشاشة (مدفونة) وتأتي الشاشة من نوع Foldable Dynamic AMOLED 2X بمساحة 7.6 إنش بجودة بدقة 1768×2208 بكسل بمعدل كثافة بكسلات 374 بكسل لكل إنش مع أبعاد عرض بنسبة 22.5:18 لتحصل على رؤية أكبر بكثير على الشاشة كما تدعم معدل التحديث الأعلى الـ 120Hz لتقديم أداء أفضل بالأخص أثناء اللعب كما تدعم الشاشة خاصية الـ HDR10+ .\r\nأما عن الشاشة الثانية ( عند طي الهاتف ) تأتي بشكل الثقب في منتصف الشاشة على هيئة حرف الـ O التي تظهر عند الطي فتأتي من نوع Dynamic AMOLED 2X بمساحة 6.2 إنش بجودة الـ HD+ بدقة 832×2268 بكسل تدعم معدل التحديث الـ 120Hz مع أبعاد عرض بنسبة 24.5:9 , وهذه الشاشة طويلة ولكن عرضها ليس الأفضل بسبب وجود مفصلة الفولد بجانبها .\r\nمع وجود طبقة حماية من نوع Corning Gorilla Glass Victus على شاشات الهاتف وتزعم سامسونج ان الشاشة القابلة للطي أصبحت اقوى 80% من الجيل السابق .\r\nيأتي بذاكرة صلبة بسعة 256 جيجا بايت من نوع UFS 3.1 مع ذاكرة عشوائية بسعة 12 جيجا بايت .\r\n– لا يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت الميموري .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة كوالكم من نوع Snapdragon 888 5G بتكنولوجيا 5 نانو فهو نفس معالج هاتف Xiaomi Mi 11 والـ Oppo Find X3 Pro أما عن المعالج الرسومي فيأتي من نوع Adreno 660 فالمعالج يقدم أداء ممتاز في الألعاب فهو موجه بشكل كبير للحصول على أفضل أداء رسومي .\r\nالكاميرا الأمامية تأتي بدقة 16 ميجا بكسل (عن طريق دمج الـ 4 ميجا بكسل أربعة مرات ) بفتحة عدسة F/1.8 وتأتي أسفل الشاشة وعند الطي الكاميرا الأمامية 10 ميجا بكسل بفتحة عدسة F/2.2 .\r\nالكاميرا الخلفية بارزة قليلاً عن ظهر الهاتف وتأتي بكاميرا ثلاثية حيث تأتي الكاميرا الأولى بدقة 12 ميجا بكسل بفتحة عدسة F/1.8 وهي الكاميرا الأساسية وتدعم المثبت البصري الـ OIS للحصول على أفضل تثبيت ممكن أثناء التصوير أما عن الكاميرا الثانية فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.4 وهي الخاصة بالزوم 2X بدون فقدان الجودة وتدعم المثبت البصري الـ OIS أما عن الكاميرا الثالثة فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nتدعم الكاميرات تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 30 و60 إطار في الثانية كما يدعم التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 و 60 إطار في الثانية الواحدة كما تدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة كما يدعم الهاتف تصوير الفيديوهات الـ Slow Motion بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 240 إطار في الثانية الواحدة بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 960 إطار في الثانية الواحدة .\r\nيدعم أكثر من ميكروفون لعزل الضوضاء .\r\nيدعم الواي فاي بترددات الـ a/b/g/n/ac/6e كما يدعم الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.2 كما يدعم خاصيتي الـ A2DP, LE, aptX HD .\r\nيدعم تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS .\r\nوسائل الأمان والحماية : يدعم الهاتف مستشعر البصمة ويأتي مدمج بزر الباور كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nكما يدعم الهاتف معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والضغط الجوي والجيروسكوب الخاص بتشغيل نظارات الواقع الافتراضي الـ VR .\r\nالسماعات الخارجية تأتي بصوت ستيريو لتقديم تجربة صوتية مميزة .\r\nيدعم Samsung DeX لتوصيل الهاتف بشاشة كبيرة لاسلكيا وفتح نظام مختلف من الهاتف لعرض ملفاتك بطريقة احترافية .\r\nمنفذ الـ USB يأتي من النوع الأحدث الـ Type C .\r\nالبطارية تأتي بسعة 4400 مللي أمبير كما يدعم الشحن السريع بقوة 25 واط كما يدعم الشحن اللاسلكي بقوة 11 واط كما يدعم الشحن اللاسلكي العكسي بقوة 4.5 واط .\r\nيأتي الهاتف بنظام تشغيل اندرويد 11 مع واجهة سامسونج الأحدث الـ One UI 3.5 .\r\nيتوفر الهاتف باللون يدعم الهاتف الـ NFC .\r\nيدعم الهاتف القلم المخصص للكتابة الـ S Pen ( ولكن ستحتاج إلى شراؤه بشكل منفصل ) ويعمل في الشاشة الكبيرة أما الشاشة في حالة الطي لن يعمل القلم في شاشة الغلاف .. يوجد نوعين من الـ S-Pen ألأول S-Pen Fold وهو لا يدعم بلوتوث ولا يدعم Air Actions ويتم بيعه مع جراب مخصص للقلم .. النوع الأخر S-Pen Pro وهو يدعم بلوتوث ويدعم Air Actions ولكن يتم بيعه منفردا فستحتاج الي شرائه و شراء جراب لوضعه به !\r\nأما عن أبعاد الهاتف فيأتي :-\r\n– في حالة عدم الطي تصبح أبعاد الهاتف بأبعاد 158.2×128.1×6.4 ملم .\r\n– وفي حالة الطي تصبح أبعاد الهاتف بأبعاد 158.2×67.1×14.4-16 ملم .\r\nأما بالنسبة للوزن فيأتي بوزن 271 جرام فهو ثقيل وستحتاج إلى بعض الوقت للاعتياد عليه .\r\nيدعم الهاتف شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G والجيل الخامس الـ 5G .\r\nالهاتف يأتي مقاوم للماء العذب بشهادة IPX8 حتى متر ونصف أسفل الماء للمدة 30 دقيقة .\r\nمتانة وجودة الخامات المستخدمة في تصنيع الهاتف تأتي من الزجاج في ظهر الهاتف مع إطار من الالمونيوم مع حماية على الظهر Corning Gorilla Glass Victus .\r\nالشاشة الكبيرة تأتي كاملة فالكاميرا الأمامية أسفل الشاشة (مدفونة) وتأتي الشاشة من نوع Foldable Dynamic AMOLED 2X بمساحة 7.6 إنش بجودة بدقة 1768×2208 بكسل بمعدل كثافة بكسلات 374 بكسل لكل إنش مع أبعاد عرض بنسبة 22.5:18 لتحصل على رؤية أكبر بكثير على الشاشة كما تدعم معدل التحديث الأعلى الـ 120Hz لتقديم أداء أفضل بالأخص أثناء اللعب كما تدعم الشاشة خاصية الـ HDR10+ .\r\nأما عن الشاشة الثانية ( عند طي الهاتف ) تأتي بشكل الثقب في منتصف الشاشة على هيئة حرف الـ O التي تظهر عند الطي فتأتي من نوع Dynamic AMOLED 2X بمساحة 6.2 إنش بجودة الـ HD+ بدقة 832×2268 بكسل تدعم معدل التحديث الـ 120Hz مع أبعاد عرض بنسبة 24.5:9 , وهذه الشاشة طويلة ولكن عرضها ليس الأفضل بسبب وجود مفصلة الفولد بجانبها .\r\nمع وجود طبقة حماية من نوع Corning Gorilla Glass Victus على شاشات الهاتف وتزعم سامسونج ان الشاشة القابلة للطي أصبحت اقوى 80% من الجيل السابق .\r\nيأتي بذاكرة صلبة بسعة 256 جيجا بايت من نوع UFS 3.1 مع ذاكرة عشوائية بسعة 12 جيجا بايت .\r\n– لا يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت الميموري .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة كوالكم من نوع Snapdragon 888 5G بتكنولوجيا 5 نانو فهو نفس معالج هاتف Xiaomi Mi 11 والـ Oppo Find X3 Pro أما عن المعالج الرسومي فيأتي من نوع Adreno 660 فالمعالج يقدم أداء ممتاز في الألعاب فهو موجه بشكل كبير للحصول على أفضل أداء رسومي .\r\nالكاميرا الأمامية تأتي بدقة 16 ميجا بكسل (عن طريق دمج الـ 4 ميجا بكسل أربعة مرات ) بفتحة عدسة F/1.8 وتأتي أسفل الشاشة وعند الطي الكاميرا الأمامية 10 ميجا بكسل بفتحة عدسة F/2.2 .\r\nالكاميرا الخلفية بارزة قليلاً عن ظهر الهاتف وتأتي بكاميرا ثلاثية حيث تأتي الكاميرا الأولى بدقة 12 ميجا بكسل بفتحة عدسة F/1.8 وهي الكاميرا الأساسية وتدعم المثبت البصري الـ OIS للحصول على أفضل تثبيت ممكن أثناء التصوير أما عن الكاميرا الثانية فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.4 وهي الخاصة بالزوم 2X بدون فقدان الجودة وتدعم المثبت البصري الـ OIS أما عن الكاميرا الثالثة فتأتي بدقة 12 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nتدعم الكاميرات تصوير الفيديوهات بجودة الـ 4K بدقة 2160 بكسل بمعدل التقاط 30 و60 إطار في الثانية كما يدعم التصوير بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 و 60 إطار في الثانية الواحدة كما تدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية الواحدة كما يدعم الهاتف تصوير الفيديوهات الـ Slow Motion بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 240 إطار في الثانية الواحدة بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 960 إطار في الثانية الواحدة .\r\nيدعم أكثر من ميكروفون لعزل الضوضاء .\r\nيدعم الواي فاي بترددات الـ a/b/g/n/ac/6e كما يدعم الـ Dual-band, Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.2 كما يدعم خاصيتي الـ A2DP, LE, aptX HD .\r\nيدعم تحديد الموقع الجغرافي الـ GPS كما يدعم أنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS .\r\nوسائل الأمان والحماية : يدعم الهاتف مستشعر البصمة ويأتي مدمج بزر الباور كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nكما يدعم الهاتف معظم المستشعرات الأخرى مثل التسارع والقرب والبوصلة والضغط الجوي والجيروسكوب الخاص بتشغيل نظارات الواقع الافتراضي الـ VR .\r\nالسماعات الخارجية تأتي بصوت ستيريو لتقديم تجربة صوتية مميزة .\r\nيدعم Samsung DeX لتوصيل الهاتف بشاشة كبيرة لاسلكيا وفتح نظام مختلف من الهاتف لعرض ملفاتك بطريقة احترافية .\r\nمنفذ الـ USB يأتي من النوع الأحدث الـ Type C .\r\nالبطارية تأتي بسعة 4400 مللي أمبير كما يدعم الشحن السريع بقوة 25 واط كما يدعم الشحن اللاسلكي بقوة 11 واط كما يدعم الشحن اللاسلكي العكسي بقوة 4.5 واط .\r\nيأتي الهاتف بنظام تشغيل اندرويد 11 مع واجهة سامسونج الأحدث الـ One UI 3.5 .\r\nيتوفر الهاتف باللون الفضي وباللون الأسود وباللون الاخضر وباللون الأسود وباللون الاخضر ', 'أصبح يدعم القلم الـ S-Pen .\r\nالسماعات الخارجية تقدم تجربة ممتازة .\r\nيأتي مقاوم للماء العذب بشهادة الـ IPX8 .\r\nيدعم الهاتف خدمات الجيل الخامس الـ 5G .\r\nيدعم تشغيل شريحتين اتصال .\r\nمعالج كوالكم الـ Snapdragon 888 يقدم أداء قوي جداً حتى في المهام الثقيلة .\r\nذاكرة صلبة وعشوائية كبيرة تكفي جميع ملفاتك وتطبيقاتك مع مرونة كبيرة في التنقل بينهما .\r\nأول شاشة من سامسونج بكاميرا سيلفي مخفية تحت الشاشة نراها في الشاشة الكبيرة الـ 7.6 بوصة للفولد 3 التي تمتاز بتردد 120 هرتز وجودة الوان مميزة وتجربة فريده كما لا ننسى حماية الشاشة التي أصبحت أفضل واعتمادية أكتر بشكل كبير .\r\nلم يتم اهمال شاشة الـ Cover الخارجية عند طي الهاتف هي أيضا من نوع ممتاز و بتردد 120 هرتز .\r\nاداء ممتاز من الكاميرات الخلفية .\r\nأحدث نظام تشغيل اندرويد 11 مع واجهة سامسونج المخصصة للـ Fold الـ One UI 3.5 والذي تم تطويرها بشكل كبير لتحصل على تجربة مميزة في الـ Multi Tasking', 'سعر مرتفع جداً .\r\nوزن الهاتف ما زال ثقيل .\r\nلا يدعم إمكانية تركيب كارت ميموري .\r\nلا يدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nلم يتم عمل اية ترقية على الكاميرات الخلفية فهي نفسها الموجودة في الـ Galaxy Z Fold 2 .\r\nلم يتم تطوير حجم البطارية كما لم يتم تطوير سرعات الشحن وما زالت بطيئة بشكل كبير .\r\nالشاشة الخارجية ليست عريضه بالشكل الكافي لاستخدامها بسهولة .\r\nما زالت التطبيقات تحتاج الي تطوير يتم عرضها بشكل أفضل على الشاشة الخارجية بدون الحاجة الي تعديل الـ Aspect Ratio .\r\nتحتاج الي شراء القلم الـ S-Pen مع جراب بشكل منفرد كما ستحتاج الي شراء الشاحن لأنه لا يأتي مع الهاتف', '4400 مللي أمبير', '', '', '', '', ''),
(12, 'Samsung Galaxy M12', 0, '', '', '', '', '', ' ثماني النواة Exynos 850 تكنولوجيا 8 نانو', 'خلفية رباعية 48+5+2+2 م.ب. / امامية 8 م.ب.', ' 6.5 بوصة بدقة HD+ بها نوتش صغير', '64/128', '4 جيجا رام', ' اندرويد 11', 'يدعم الهاتف الراديو الـ Fm .\r\nيأتي الهاتف بأبعاد 164×75.9×9.7 ملم مع وزن 221 جرام .\r\nيدعم شريحتين إتصال من نوع Nano Sim .\r\nيدعم شبكات الاتصال الجيل الثاني الـ 2G والجيل الثالث الـ 3G والجيل الرابع الـ 4G .\r\nمتانة وجودة الخامات التي تم استخدامها في تصنيع الهاتف تأتي من البلاستيك بالكامل سواء الظهر أو الإطار مع نقش مميز في ظهر الهاتف ليكون مقاوم للتبصيم بأكبر قدر ممكن .\r\nالشاشة تأتي بشكل النوتش على هيئة الـ Water Drop من نوع PLS IPS بمساحة 6.5 إنش بجودة الـ HD+ بدقة 720×1600 بكسل بمعدل كثافة 270 بكسل لكل إنش مع تردد 90 هرتز مع دعم الشاشة لأبعاد عرض بنسبة 20:9 لعرض محتوى أكبر على شاشة الهاتف .\r\nالذاكرة الصلبة تأتي بأكثر من إصدار من الذاكرة الصلبة والذاكرة العشوائية على النحو التالي :-\r\n– الإصدار الثاني يأتي بذاكرة صلبة بسعة 64 جيجا بايت من نوع eMMC 5.1 مع ذاكرة عشوائية بسعة 4 جيجا بايت .\r\n– الإصدار الثالث يأتي بذاكرة صلبة بسعة 128 جيجا بايت من نوع eMMC 5.1 مع ذاكرة عشوائية بسعة 4 جيجا بايت .\r\n– يدعم الهاتف إمكانية زيادة المساحة التخزينية عن طريق كارت ميموري في منفذ منفصل .\r\nأما عن الأداء فالهاتف يأتي بمعالج من شركة اكسنوس من نوع Exynos 850 بتكنولوجيا الـ 8 نانو مع معالج رسومي من نوع Mali-G52 فهو نفس المعالج الذي رايناه مسبقاً في هاتف الـ Samsung Galaxy A21s .\r\nالكاميرا الأمامية تأتي بدقة 8 ميجا بكسل بفتحة عدسة F/2.2 .\r\nالكاميرا الخلفية تأتي بكاميرا رباعية حيث تأتي الكاميرا الأولى بدقة 48 ميجا بكسل بفتحة عدسة F/2.0 وهي الكاميرا الأساسية أما عن الكاميرا الثانية فتأتي بدقة 5 ميجا بكسل بفتحة عدسة F/2.2 وهي الكاميرا الخاصة بالتصوير الواسع أما عن الكاميرا الثالثة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بالتصوير الماكرو اما عن الكاميرا الرابعة فتأتي بدقة 2 ميجا بكسل بفتحة عدسة F/2.4 وهي الكاميرا الخاصة بعمل العزل والبورتريه بالإضافة إلى فلاش أحادي من نوع ليد فلاش .\r\nيدعم الهاتف تصوير الفيديوهات بجودة الـ FHD بدقة 1080 بكسل بمعدل التقاط 30 إطار في الثانية كما يدعم التصوير بجودة الـ HD بدقة 720 بكسل بمعدل التقاط 30 إطار في الثانية .\r\nالواي فاي يأتي بترددات الـ b/g/n كما يدعم خاصيتي الـ Wi-Fi Direct, hotspot .\r\nالبلوتوث يأتي بإصدار 5.0 مع دعمه لخاصية الـ A2DP .\r\nيدعم تحديد الموقع الجغرافي الـ GPS بالإضافة لدعمه لأنظمة الملاحة الأخرى مثل الـ A-GPS, GLONASS, GALILEO, BDS لتحديد الموقع الجغرافي بشكل أكثر دقة .\r\nوسائل الأمان والحماية يدعم الهاتف مستشعر البصمة ويأتي مدمج بزر الباور كما يدعم خاصية الـ Face Unlock لفتح الهاتف عن طريق الوجه .\r\nبالإضافة لدعمه للمستشعرات الأخرى مثل التسارع والقرب .\r\nيدعم منفذ الـ 3.5 ملم الخاص بسماعات الاذن .\r\nأما عن منفذ الـ USB فيأتي من نوع Type C .\r\nالبطارية تأتي بسعة 5000 مللي امبير مع شحن بقوة 15 واط .\r\nيأتي الهاتف بنظام تشغيل أندرويد 11 مع واجهة سامسونج المخففة الـ One UI Core 3.1 .\r\nيتوفر الهاتف باللون الأزرق و الأسود و الأخضر', 'منفذ الـ USB يأتي من النوع الأحدث الـ Type C .\r\nبطارية كبيرة تكفي للعمل لفترة طويلة خلال اليوم حتى مع الاستخدام المكثف .\r\nالشحن يأتي بقوة 15 واط ليمكنك من شحن البطارية خلال وقت مقبول ولكن كنا نطمح أن يأتي أقوى من ذلك لتتناسب مع سعة البطارية .\r\nبالرغم أن الهاتف اقتصادي الا ان شاشة الهاتف داعمة لمعدل تحديث مرتفع 90 هرتز .\r\nالكاميرا الخلفية تقدم اداء مقبول ولكن في الاضاءات المرتفعة فقط و يقل الاداء في التصوير الليلي .\r\nيدعم الهاتف إمكانية استخدام شريحتين إتصال وكارت ميموري في نفس الوقت', 'لا يوجد لمبة اشعارات للأسف .\r\nالشاشة تأتي بجودة HD+ فقط مع انخفاض حدة التفاصيل على الشاشة .\r\nالحافة السفلية لشاشة الهاتف ما زالت كبيرة ولم يتم العمل على جعلها أفضل .\r\nلا يأتي مع الهاتف جراب ولا سماعة أذن في العلبة .\r\nتخانة كبيرة و وزن كبير بسبب البطارية الضخمة .\r\nاداء المعالج ليس الأقوى ولكنه معالج مقبول و موفر جدا لاستهلاك البطارية .\r\nيأتي الهاتف بنسخة مخففة من واجهة سامسونج مما يعني انك ستفقد بعض المميزات ولكن تخفيف الواجهة سيحسن قليلا من الاداء .', '5000 مللي أمبير', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `mobile price`
--

CREATE TABLE `mobile price` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL,
  `location` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `mobile price`
--

INSERT INTO `mobile price` (`id`, `name`, `price`, `location`) VALUES
(1, 'iPhone SE 2020', 'السعر حوالي 8000 جنية للنسخة 64 جيجا و حوالي 9200 جنية للنسخة 128 جيجا .\r\n\r\n', 'تريد لاين'),
(2, 'iPhone 12', 'السعر العالمي 700 دولار لأقل نسخة 64 جيجا .. و 750 دولار للنسخة 128 جيجا .. و 850 دولار للنسخة 256 جيجا .\r\n\r\nالسعر في المحلات المصرية .. حوالي 12500 جنية للنسخة 128 جيجا', 'بي تك'),
(3, 'iPhone 13 Mini', 'السعر الرسمي 700 دولار لأقل نسخة 128 جيجا .. و 800 دولار للنسخة 256 جيجا .. و 1000 دولار للنسخة 512 جيجا .. هذه هي الأسعار العالمية .\r\n\r\nفي المحلات المصرية بحوالي 16000 جنية للنسخة 256 جيجا .', 'متجر ألف Aleph - المعتمد من Apple'),
(4, 'Iphone 6s Plus', 'جمهورية مصر العربية : 6500 جنيه مصري للنسخة 32 جيجا بايت\r\n\r\n', 'متجر ألف Aleph - المعتمد من Apple'),
(5, 'Oppo A16K', 'السعر الرسمي 2590 جنية للنسخة 32 جيجا مع 3 جيجا رام .\r\n\r\n', 'بى تك'),
(6, 'Oppo A94', 'السعر حوالي 4850 جنية للنسخة 128 جيجا مع 8 جيجا رام .\r\n\r\n', ' 20 شارع جمال سالم – الدقي'),
(7, 'Oppo Find X3 Pro', 'السعر بالخارج حوالي 1100$ للنسخة 256 جيجا مع 12 جيجا رام و لن يتم نزول الهاتف بشكل رسمي في مصر .\r\n\r\n', ': 3 شارع صلاح سالم – مباني العبور بجانب مونجيني'),
(8, 'Oppo A73', 'السعر حوالي 4850 جنية للنسخة 128 جيجا مع 8 جيجا رام .\r\n', '48 شارع المشاية – أمام جزيرة الورد'),
(9, 'Samsung Galaxy S22 Ultra 5G', 'السعر الرسمي 25700 جنية للنسخة 256 جيجا مع 12 جيجا رام', 'توكيل سامسونج فيصل'),
(10, 'Samsung Galaxy A52s 5G', 'للنسخة 128 جيجا مع 8 جيجا رام بسعر حوالي 6600 جنية .\r\n\r\nللنسخة 256 جيجا مع 8 جيجا رام بسعر حوالي 7400 جنية', 'توكيل سامسونج فرع مول العرب'),
(11, 'Samsung Galaxy Z Fold 3', 'السعر حوالي 28000 جنية للنسخة 256 جيجا مع 12 جيجا رام', 'توكيل سامسونج الدقي'),
(12, 'Samsung Galaxy M12', 'للنسخة 64 جيجا مع 4 جيجا رام بسعر 2550 جنية .\r\n\r\nللنسخة 128 جيجا مع 4 جيجا رام بسعر  2900 جنية .\r\nللنسخة 64 جيجا مع 4 جيجا رام بسعر 2550 جنية .\r\n\r\nللنسخة 128 جيجا مع 4 جيجا رام بسعر  2900 جنية .\r\n\r\n\r\n', 'توكيل سامسونج فرع المنيل');

-- --------------------------------------------------------

--
-- Table structure for table `mobile stor`
--

CREATE TABLE `mobile stor` (
  `id` int(11) NOT NULL,
  `Supplier` varchar(255) NOT NULL,
  `mobile name` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `mobile stor`
--

INSERT INTO `mobile stor` (`id`, `Supplier`, `mobile name`, `price`) VALUES
(1, 'amazon', 'iPhone SE 2020', '8890'),
(2, 'jumia', 'iPhone SE 2020', '8800'),
(3, 'tred line', 'iPhone 12', '13000'),
(4, 'amazon', 'iPhone 12', '12850'),
(5, 'تاون سنتر مول', 'Oppo A16K', '2950'),
(6, 'دبي فون', 'Oppo A16K', '2730'),
(7, 'amazon', 'Oppo A94', '4800'),
(8, 'مول العرب', 'Oppo A94', '4750'),
(9, 'بي تك', 'Samsung Galaxy S22 Ultra 5G', '25750'),
(10, 'eBay.com', 'Samsung Galaxy S22 Ultra 5G', '25700'),
(11, 'jumia', 'Samsung Galaxy Z Fold 3', '27800'),
(12, 'Aliexpress.com', 'Samsung Galaxy Z Fold 3', '28000'),
(13, 'Amazon', 'iPhone 13 Mini', '12870'),
(14, 'terd line', 'iPhone 13 Mini', '12590');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `news title` varchar(255) NOT NULL,
  `writer name` varchar(255) NOT NULL,
  `Release Date` int(14) NOT NULL,
  `first piece` longtext NOT NULL,
  `Sub-address` varchar(255) NOT NULL,
  `Another piece` longtext NOT NULL,
  `third piece` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `tips to keep the phone`
--

CREATE TABLE `tips to keep the phone` (
  `id` int(14) NOT NULL,
  `Advice title` int(11) NOT NULL,
  `writer name` int(11) NOT NULL,
  `Release Date` int(11) NOT NULL,
  `first piece` int(11) NOT NULL,
  `Sub address` int(11) NOT NULL,
  `another piece` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  ` user id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `usernam` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`UserID`),
  ADD UNIQUE KEY `Username` (`Username`);

--
-- Indexes for table `evaluation`
--
ALTER TABLE `evaluation`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `favorite list`
--
ALTER TABLE `favorite list`
  ADD PRIMARY KEY (`user id`);

--
-- Indexes for table `mobile menu`
--
ALTER TABLE `mobile menu`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mobile price`
--
ALTER TABLE `mobile price`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mobile stor`
--
ALTER TABLE `mobile stor`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tips to keep the phone`
--
ALTER TABLE `tips to keep the phone`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (` user id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `UserID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `evaluation`
--
ALTER TABLE `evaluation`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `favorite list`
--
ALTER TABLE `favorite list`
  MODIFY `user id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `mobile menu`
--
ALTER TABLE `mobile menu`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `mobile price`
--
ALTER TABLE `mobile price`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `mobile stor`
--
ALTER TABLE `mobile stor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tips to keep the phone`
--
ALTER TABLE `tips to keep the phone`
  MODIFY `id` int(14) NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_ibfk_1` FOREIGN KEY (` user id`) REFERENCES `favorite list` (`user id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
